Тестовая_база_ERP_14/src/AccumulationRegisters/ПланыПроизводства/ПланыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыПроизводства</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПовторноеРазузлование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторКорректировки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыпускаПолуфабриката</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗапускаВыпуска</name>
    <comment>Если тип процесса Сборка или Ремонт - то дата запуска; если Разборка - то дата выпуска</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоПолуфабрикат</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПроизводственногоПроцесса</name>
    <type>
      <types>EnumRef.ТипыПроизводственныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлана</name>
    <comment>Вид замещающего плана</comment>
    <type>
      <types>CatalogRef.ВидыПланов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ОтменаКорректировокПланаПроизводства/ОтменаКорректировокПланаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтменаКорректировокПланаПроизводства</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКорректировки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>АвторКорректировки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыпускаПолуфабриката</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоПолуфабрикат</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ОчередьРасчетаПланаПроизводства/ОчередьРасчетаПланаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРасчетаПланаПроизводства</name>
  <resources>
    <name>УдалитьКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </resources>
  <resources>
    <name>ПересчитатьВсеПотребности</name>
    <comment>Истина - фоновое проведение должно привести к полному пересчету данных документа; Ложь - будут пересчитаны только измененные данные</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ЕстьОшибкиРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыпускПолуфабрикатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланПроизводстваПересчет</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ТипыПроизводственныхПроцессов/ТипыПроизводственныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПроизводственныхПроцессов</name>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Разборка</name>
  </enumValues>
  <enumValues>
    <name>БезСпецификаций</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/AccumulationRegisters/ПланыПроизводства/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Регистратор = Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПланПроизводства") Тогда
		
		РассчитатьПоребности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Регистратор, "Сценарий.ИспользоватьДляПланированияМатериалов");
		
		Если РассчитатьПоребности Тогда
		
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
			
			ПрочитатьСтарыеИНовыеДвижения(МенеджерВременныхТаблиц, Регистратор);
			
			ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка 
		ИЛИ НЕ ДополнительныеСвойства.Свойство("МенеджерВременныхТаблиц") Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТКА
	СверитьКорректировкиДвижений();
	//-- НЕ УТКА
	
	ОтменаПроведения = ?(ДополнительныеСвойства.Свойство("РежимЗаписи"),
		ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения,
		Ложь);
	
	Если НЕ ОтменаПроведения Тогда
		
		СверитьДвижения();
		
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТКА
Процедура СверитьКорректировкиДвижений()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтарыеДвижения.ПланПроизводства КАК ПланПроизводства,
		|	СтарыеДвижения.Номенклатура КАК Номенклатура,
		|	СтарыеДвижения.Характеристика КАК Характеристика,
		|	СтарыеДвижения.Назначение КАК Назначение,
		|	СтарыеДвижения.Спецификация КАК Спецификация,
		|	ВЫБОР
		|		КОГДА СтарыеДвижения.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА СтарыеДвижения.ДатаПроизводства
		|		ИНАЧЕ СтарыеДвижения.ДатаЗапускаВыпуска
		|	КОНЕЦ КАК ДатаЗапуска,
		|	ВЫБОР
		|		КОГДА СтарыеДвижения.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА СтарыеДвижения.ДатаЗапускаВыпуска
		|		ИНАЧЕ СтарыеДвижения.ДатаПроизводства
		|	КОНЕЦ КАК ДатаВыпуска,
		|	СтарыеДвижения.ДатаВыпускаПолуфабриката КАК ДатаВыпускаПолуфабриката,
		|	СтарыеДвижения.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
		|	СтарыеДвижения.Количество КАК Количество,
		|	СтарыеДвижения.ДатаКорректировки КАК ДатаКорректировки,
		|	СтарыеДвижения.АвторКорректировки КАК АвторКорректировки,
		|	СтарыеДвижения.Комментарий КАК Комментарий
		|ИЗ
		|	СтарыеДвижения КАК СтарыеДвижения
		|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеДвижения КАК НовыеДвижения
		|		ПО СтарыеДвижения.ДатаПроизводства = НовыеДвижения.ДатаПроизводства
		|			И СтарыеДвижения.Сценарий = НовыеДвижения.Сценарий
		|			И СтарыеДвижения.Номенклатура = НовыеДвижения.Номенклатура
		|			И СтарыеДвижения.Характеристика = НовыеДвижения.Характеристика
		|			И СтарыеДвижения.Подразделение = НовыеДвижения.Подразделение
		|			И СтарыеДвижения.ПланПроизводства = НовыеДвижения.ПланПроизводства
		|			И СтарыеДвижения.Спецификация = НовыеДвижения.Спецификация
		|			И СтарыеДвижения.Назначение = НовыеДвижения.Назначение
		|			И СтарыеДвижения.ДатаВыпускаПолуфабриката = НовыеДвижения.ДатаВыпускаПолуфабриката
		|			И СтарыеДвижения.ДатаЗапускаВыпуска = НовыеДвижения.ДатаЗапускаВыпуска
		|			И СтарыеДвижения.ЭтоПолуфабрикат = НовыеДвижения.ЭтоПолуфабрикат
		|			И СтарыеДвижения.РучнаяКорректировка = НовыеДвижения.РучнаяКорректировка
		|ГДЕ
		|	СтарыеДвижения.РучнаяКорректировка
		|	И НовыеДвижения.Номенклатура ЕСТЬ NULL");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	ТаблицаКорректировки = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаКорректировки.Количество() > 0 Тогда
		
		РегистрыСведений.ОтменаКорректировокПланаПроизводства.ЗаписатьКорректировки(
			ТаблицаКорректировки,
			Отбор.Регистратор.Значение);
		
	КонецЕсли;
	
КонецПроцедуры
//-- НЕ УТКА

Процедура СверитьДвижения()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОчередьРасчета.ДатаПроизводства КАК ДатаПроизводства,
		|	ОчередьРасчета.ПланПроизводства КАК ПланПроизводства,
		|	ОчередьРасчета.Подразделение КАК Подразделение,
		|	ОчередьРасчета.Спецификация КАК Спецификация,
		|	ОчередьРасчета.Назначение КАК Назначение,
		|	ОчередьРасчета.Сценарий КАК Сценарий,
		|	ЛОЖЬ КАК ВыпускПолуфабрикатов
		|ИЗ
		|	(ВЫБРАТЬ
		|		НовыеДвижения.ПланПроизводства КАК ПланПроизводства,
		|		НовыеДвижения.Номенклатура КАК Номенклатура,
		|		НовыеДвижения.Характеристика КАК Характеристика,
		|		НовыеДвижения.Спецификация КАК Спецификация,
		|		НовыеДвижения.Количество КАК КоличествоРазность,
		|		НовыеДвижения.ДатаПроизводства КАК ДатаПроизводства,
		|		НовыеДвижения.Сценарий КАК Сценарий,
		|		НовыеДвижения.Подразделение КАК Подразделение,
		|		НовыеДвижения.Назначение КАК Назначение
		|	ИЗ
		|		НовыеДвижения КАК НовыеДвижения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтарыеДвижения.ПланПроизводства,
		|		СтарыеДвижения.Номенклатура,
		|		СтарыеДвижения.Характеристика,
		|		СтарыеДвижения.Спецификация,
		|		-СтарыеДвижения.Количество,
		|		СтарыеДвижения.ДатаПроизводства,
		|		СтарыеДвижения.Сценарий,
		|		СтарыеДвижения.Подразделение,
		|		СтарыеДвижения.Назначение
		|	ИЗ
		|		СтарыеДвижения КАК СтарыеДвижения) КАК ОчередьРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ОчередьРасчета.ДатаПроизводства,
		|	ОчередьРасчета.ПланПроизводства,
		|	ОчередьРасчета.Подразделение,
		|	ОчередьРасчета.Спецификация,
		|	ОчередьРасчета.Назначение,
		|	ОчередьРасчета.Сценарий,
		|	ОчередьРасчета.Номенклатура,
		|	ОчередьРасчета.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОчередьРасчета.КоличествоРазность) <> 0");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	ТаблицаОчередь = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаОчередь.Количество() > 0 Тогда
		
		РегистрыСведений.ОчередьРасчетаПланаПроизводства.ЗаписатьОчередь(
			ТаблицаОчередь,
			Отбор.Регистратор.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрочитатьСтарыеИНовыеДвижения(МенеджерВременныхТаблиц, ПланПроизводства)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПланПроизводства", ПланПроизводства);
	Запрос.УстановитьПараметр("НовыеДвиженияПланыПроизводства", ЭтотОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтарыеДвижения.Период КАК ДатаПроизводства,
	|	СтарыеДвижения.Сценарий КАК Сценарий,
	|	СтарыеДвижения.Номенклатура КАК Номенклатура,
	|	СтарыеДвижения.Характеристика КАК Характеристика,
	|	СтарыеДвижения.Подразделение КАК Подразделение,
	|	СтарыеДвижения.ПланПроизводства КАК ПланПроизводства,
	|	СтарыеДвижения.Спецификация КАК Спецификация,
	|	СтарыеДвижения.Назначение КАК Назначение,
	|	СтарыеДвижения.ДатаВыпускаПолуфабриката КАК ДатаВыпускаПолуфабриката,
	|	СтарыеДвижения.ДатаЗапускаВыпуска КАК ДатаЗапускаВыпуска,
	|	СтарыеДвижения.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	СтарыеДвижения.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	СтарыеДвижения.Количество КАК Количество,
	|	СтарыеДвижения.РучнаяКорректировка КАК РучнаяКорректировка,
	|	СтарыеДвижения.ДатаКорректировки КАК ДатаКорректировки,
	|	СтарыеДвижения.АвторКорректировки КАК АвторКорректировки,
	|	СтарыеДвижения.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ СтарыеДвижения
	|ИЗ
	|	РегистрНакопления.ПланыПроизводства КАК СтарыеДвижения
	|ГДЕ
	|	СтарыеДвижения.Регистратор = &ПланПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеДвижения.Период КАК ДатаПроизводства,
	|	НовыеДвижения.Сценарий КАК Сценарий,
	|	НовыеДвижения.Номенклатура КАК Номенклатура,
	|	НовыеДвижения.Характеристика КАК Характеристика,
	|	НовыеДвижения.Подразделение КАК Подразделение,
	|	НовыеДвижения.ПланПроизводства КАК ПланПроизводства,
	|	НовыеДвижения.Спецификация КАК Спецификация,
	|	НовыеДвижения.Назначение КАК Назначение,
	|	НовыеДвижения.ДатаВыпускаПолуфабриката КАК ДатаВыпускаПолуфабриката,
	|	НовыеДвижения.ДатаЗапускаВыпуска КАК ДатаЗапускаВыпуска,
	|	НовыеДвижения.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	НовыеДвижения.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	НовыеДвижения.Количество КАК Количество,
	|	НовыеДвижения.РучнаяКорректировка КАК РучнаяКорректировка,
	|	НовыеДвижения.ДатаКорректировки КАК ДатаКорректировки,
	|	НовыеДвижения.АвторКорректировки КАК АвторКорректировки,
	|	НовыеДвижения.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ НовыеДвижения
	|ИЗ
	|	&НовыеДвиженияПланыПроизводства КАК НовыеДвижения";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
